import React, {useState} from 'react';
import {
  View,
  Text,
  FlatList,
  StyleSheet,
  Image,
  TouchableOpacity,
} from 'react-native';

const CropInfoScreen = ({navigation}) => {
  const [crops, setCrops] = useState([
    {
      id: '1',
      name: 'گندم',
      season: 'ربیع',
      waterRequirements: 'کم سے درمیانہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '20 سے 25 ڈگری سینٹی گریڈ',
      soilType: 'گہری، زرخیز مٹی',
      image: require('../Images/wheat.jpg'),
      otherInfo:
        'پاکستان میں ایک اہم خوراکی فصل ہے، جو روٹی کی بنیادی اجزاء میں سے ایک ہے۔',

      description: `گندم پاکستان کی سب سے اہم فصل ہے اور گندم کے آٹے سے بنی روٹی ہماری خوراک کا اہم حصہ ہے۔ ربیع کی فصل کے طور پر، پاکستان میں تقریباً 9 ملین ہیکٹر رقبہ پر گندم کی کاشت کی جاتی ہے جو ہمارے ملک کے کل کاشت شدہ رقبہ کا تقریباً 80 فیصد ہے۔ پاکستان، رقبہ اور پیداوار کے لحاظ سے دنیا میں گندم پیدا کرنے والے ممالک کی فہرست میں ساتویں نمبر پر ہے۔ گندم کے آٹے سے بنی روٹی نہ صرف ہماری غذائی ضروریات کو پورا کرتی ہے، بلکہ گندم کی بھوسی بھی جانوروں کے لئے پسندیدہ خوراک ہے۔ اس وقت پاکستان میں فی ایکڑ گندم کی اوسط پیداوار تقریباً 28 منڈ ہے جو دوسرے ممالک کے فی ایکڑ اوسط پیداوار کے مقابلے میں بہت کم ہے۔ پاکستان میں فی ایکڑ گندم کی پیداوار میں مزید اضافہ کی گنجائش ہے۔ کسانوں کو اچھی گندم کی پیداوار حاصل کرنے کے لئے ان سفارشات پر عمل کرنے کی ہدایت کی جا سکتی ہے۔ کاشت کا وقت فی ایکڑ زیادہ گندم کی پیداوار حاصل کرنے کے لئے 30 نومبر سے پہلے گندم کی کاشت مکمل کرنا بہت ضروری ہے۔
       30 نومبر کے بعد کاشت کی جانے والی گندم کی فی ایکڑ پیداوار روزانہ تقریباً 12 سے 16 کلوگرام کم `,
    },
    {
      id: '2',
      name: 'کپاس',
      season: 'خریف',
      waterRequirements: 'زیادہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '21 سے 30 ڈگری سینٹی گریڈ',
      soilType: 'ہلکی، گہری، زرخیز مٹی',
      description: `کپاس ہمارے ملک کی ایک سب سے اہم فائبر اور نقدی فصل ہے۔ کپاس کے ساتھ زراعت نے بلاشبہ ملک کی معاشی ترقی میں حصہ ڈالا ہے اور ہزاروں کسانوں کے لیے آمدنی کا اہم ذریعہ رہا ہے۔ کپاس ملک کی کل زرمبادلہ آمدنی کا 51 فیصد حصہ بنتی ہے۔ کپاس کی فصل سے زیادہ آمدنی حاصل کرنے کے لیے فی ایکڑ زیادہ پیداوار اور بہتر کوالٹی ضروری ہیں۔ 5 ملین کسانوں میں سے تقریباً 1.5 ملین کسان کپاس کی کاشت 6 ملین ایکڑ پر کرتے ہیں، جو ملک میں کل کاشت شدہ علاقے کا 15 فیصد ہے۔ فی الحال، پاکستان دنیا کا پانچواں سب سے بڑا کپاس کا پیداوار کنندہ اور تیسرا سب سے بڑا کپاس کے دھاگے کا پیداوار کنندہ ہے۔ کپاس کی پیداوار میں غیر معمولی اضافہ نے ایک بڑی اور زندہ دل ٹیکسٹائل انڈسٹری کے ظہور میں مدد دی ہے جس میں 1000 سے زیادہ جننگ فیکٹریاں اور 400 سے زیادہ ٹیکسٹائل ملیں شامل ہیں۔
      پاکستان میں کپاس زیادہ تر پنجاب اور سندھ میں بڑے علاقے پر اگائی جاتی ہے۔ پنجاب، جو کپاس کی پیداوار کے لیے سب سے زیادہ موزوں ہے، ملک کی کپاس کا تقریباً 70% پیدا کرتا ہے اور سندھ 28%۔ پنجاب میں کپاس اگانے والے بڑے علاقے ملتان، بہاولپور، وہاڑی، لودھراں، خانیوال، رحیمیار خان، بہاولنگر، ڈی جی خان، راجن پور، مظفرگڑھ، لہر اور ساہیوال شامل ہیں۔ جبکہ ثانوی علاقے جھنگ، بھکر، میانوالی، فیصل آباد، ٹوبہ ٹیک سنگھ، قصور، پاکپتن اور اوکاڑہ شامل ہیں۔
      زمین کا انتخاب
      فی ایکڑ کپاس کی پیداوار بڑھانے کے لیے، ایک ایسی مٹی کا انتخاب کریں جو زرخیز، نرم، زرخیز، ہوادار، ہموار، پانی جذب کرنے والی اور طویل مدتی ذخیرہ کرنے کی صلاحیت رکھتی ہو۔ اس کے علاوہ، اس زمین میں نامیاتی مواد کی مقدار بھی اچھی ہونی چاہیے۔ مٹی کی اندرونی سطح بہت سخت نہیں ہونی چاہیے تاکہ کپاس کے پودوں کی جڑیں آسانی سے نیچے اور اطراف میں پھیل سکیں۔ کلرتھی، بین اور تھور مٹی کپاس کی کاشت کے لیے موزوں نہیں ہے۔
      زمین کی تیاری
      پاکستان میں کپاس زیادہ تر مختلف فصلوں کی کٹائی کے بعد اگائی جاتی ہے۔ آبپاشی اور بارانی علاقوں میں، بڑے پیمانے پر کپاس کی کاشت کی جاتی ہے، جس کے بعد گندم، سرسوں، اور کینولا کی کٹائی ہوتی ہے۔ سرسوں اور گندم کی کٹائی کے بعد اور جب متعلقہ فصلیں کھیت سے نکال لی جاتی ہیں، تو کھیت کو آبپاشی کریں اور چند دنوں کے بعد موزوں موسمی حالات میں ہل چلا کر اور روٹاویٹر یا ڈسک کا استعمال کرکے مٹی کو ڈھیلا کریں۔ اگر زمین ہموار نہیں ہے، تو لیزر لینڈ لیولر کا استعمال کرکے زمین کو ہموار کریں۔ اگر آپ کپاس کو ڈرل سے کاشت کرنا چاہتے ہیں، تو اسے قطاروں میں بنائیں، اور اگر آپ کپاس کو ٹریکس پر کاشت کرنا چاہتے ہیں، تو 2 بار ہل چلا کر پلو بنائیں۔
      سبز کھاد کے طور پر استعمال ہونے والی فصلوں جیسے کہ برسیم وغیرہ کو کپاس لگانے سے 30 دن پہلے زمین میں دبائیں اور 10 دنوں کے اندر کھیت کو آبپاشی کریں تاکہ سبز کھاد مٹی میں اچھی طرح سے گل سڑ جائے۔ تحلیل کے عمل کو تیز کرنے کے لیے، فی ایکڑ آدھا بیگ یوریا پھیلائیں اور سبز کھاد کی فصل کو روٹاویٹر یا ڈسک کا استعمال کرکے زمین میں دبائیں۔
      کاشت کا وقت
      پنجاب میں کپاس کی کاشت کا بہترین وقت 1 اپریل سے 31 مئی ہے، لیکن فی ایکڑ کپاس کی زیادہ سے زیادہ پیداوار حاصل کرنے کے لیے، 15 مئی تک کپاس کی کاشت مکمل کریں۔ اپریل کے شروع میں کپاس کی کاشت کو اگیتی کاشت کہا جاتا ہے اور مئی کے وسط کے بعد کپاس کی کاشت کو دیر سے کاشت سمجھا جاتا ہے`,
      image: require('../Images/cotton.jpeg'),
      otherInfo: 'کپاس سے کپڑا اور دیگر مصنوعات بنائی جاتی ہیں۔',
    },
    {
      id: '3',
      name: 'مکئی',
      season: 'خریف و ربیع',
      waterRequirements: 'درمیانہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '18 سے 27 ڈگری سینٹی گریڈ',
      soilType: 'مٹی جس میں اچھی زرخیزی ہو',
      description: `مکئی کی قیمت زیادہ تر مکئی میں نمی کی مقدار پر منحصر ہوتی ہے۔ مکئی میں نمی کی مقدار جتنی کم ہوگی، مکئی کی قیمت اتنی ہی زیادہ ہوگی۔ اگر مکئی کے ریٹ کا موازنہ پچھلے سال 2023 سے کیا جائے، تو 2023 کے شروع میں مکئی کے ریٹ میں کافی اضافہ ہوا لیکن 2023 کے آخر میں مکئی کی قیمت میں نمایاں کمی آئی۔ پچھلے سال مکئی کا ریٹ فی من 1800 سے 2500 روپے تھا لیکن آج 2024 میں مکئی کی قیمت کپاس کی قیمت کی طرح کم ہو گئی ہے۔ فی الحال، مکئی کے کاشتکار فکرمند ہیں کیونکہ مکئی کی فصل کی تیاری کے دوران بجلی، ڈیزل، مکئی کے بیج، اور کھادوں کی لاگت بہت زیادہ تھی۔
      مارچ 2024 میں پاکستان کے زیادہ تر شہروں بشمول کراچی اور لاہور خصوصاً فیصل آباد، گوجرانوالہ، اوکاڑہ، سرگودھا، راولپنڈی، ملتان، رحیم یار خان، بھکر، بھلوال، قصور، ساہیوال، وہاڑی، بورے والا، گجرات، خانیوال، مظفر گڑھ، بہاولپور، کبیر والا، پتوکی، اریفوالا، جڑانوالا، لودھراں، چشتیاں، گجر خان، میلسی، کہروڑ پکا، چیچہ وطنی، دنیاپور، ڈیرہ غازی خان، چونیاں، پھولنگر، لالہ موسیٰ، منڈی بہاؤالدین، جلالپور جٹاں، ڈسکہ، کمالیہ، پیرمحل، جلالپور پیروالا، جہانیاں، احمدپور شرقیہ، ہاشلپور، جامپور، سیالکوٹ، نارووال، چکوال، جہلم، میانوالی، جھنگ، کوٹ ادو، رینالہ خورد، ننکانہ صاحب، چک جھمرہ، سراندی، تاندلیانوالہ، مموں کنجن، چنیوٹ، شورکوٹ، مریدکے، فورٹ عباس، تلہ گنگ، پسرور، سانگلہ ہل، حافظ آباد، پنڈی بھٹیاں اور کوٹ مومن میں مکئی کا ریٹ فی من 1800 سے 2280 روپے ہے `,
      image: require('../Images/maize.jpeg'),
      otherInfo:
        'مکئی کو پاپ کارن، مکئی کے آٹے، اور دیگر مصنوعات کے لیے استعمال کیا جاتا ہے۔',
    },
    {
      id: '4',
      name: 'چاول',
      season: 'خریف',
      waterRequirements: 'بہت زیادہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '22 سے 32 ڈگری سینٹی گریڈ',
      soilType: 'بھاری، زرخیز مٹی جو پانی جمع کر سکے',
      description: `چاول پاکستان کی اہم زرعی فصلوں میں سے ایک ہے جو کہ زراعت پر مبنی معیشت کے لیے بہت ضروری ہے۔ پاکستان میں چاول کی کاشت بڑے پیمانے پر کی جاتی ہے اور یہ دنیا بھر میں پاکستانی چاول کی برآمد کے لیے مشہور ہے۔ چاول کی پیداوار میں پاکستان کا شمار دنیا کے بڑے ممالک میں ہوتا ہے اور یہ زرمبادلہ کمانے کا ایک اہم ذریعہ بھی ہے۔
      پاکستان میں چاول کی دو اہم اقسام کاشت کی جاتی ہیں: باسمتی اور غیر باسمتی۔ باسمتی چاول خاص طور پر پنجاب کے علاقے میں اُگایا جاتا ہے جبکہ غیر باسمتی چاول سندھ، پنجاب، اور خیبر پختونخواہ کے کچھ حصوں میں کاشت کیا جاتا ہے۔
      چاول کی کاشت کے لیے موزوں زمین وہ ہوتی ہے جہاں پانی کی مناسب دستیابی ہوتی ہے کیونکہ چاول کی بڑھوتری کے لیے زیادہ مقدار میں پانی درکار ہوتا ہے۔ پاکستان میں چاول کی کاشت عموماً خریف کے موسم میں کی جاتی ہے، جس کا آغاز جون سے ہوتا ہے اور فصل اکتوبر تا نومبر میں کٹائی کے لیے تیار ہوتی ہے۔
      چاول کی کاشت، نگہداشت اور بیماریوں سے بچاؤ کے لیے جدید زراعتی تکنیکوں اور بہتر سیڈز کا استعمال کیا جاتا ہے تاکہ فی ایکڑ زیادہ سے زیادہ پیداوار حاصل کی جا سکے۔
      
      پاکستان میں چاول کی کامیاب کاشت اور اس کی برآمد سے نہ صرف ملکی معیشت کو سہارا ملتا ہے بلکہ کسانوں کی معاشی حالت میں بھی بہتری آتی ہے۔ چاول کی برآمد سے پاکستان کو دنیا بھر میں ایک معتبر پوزیشن حاصل ہے اور یہ پاکستان کی زرعی برآمدات میں ایک اہم حصہ دار ہے۔`,
      image: require('../Images/rice.jpg'),
      otherInfo: 'چاول پکانے کے بعد پھول جاتا ہے اور غذائیت سے بھرپور ہوتا ہے۔',
    },
    {
      id: '5',
      name: 'سورج مکھی',
      season: 'ربیع',
      waterRequirements: 'کم',
      majorProducingAreas: 'پنجاب',
      idealTemperature: '20 سے 25 ڈگری سینٹی گریڈ',
      soilType: 'ہلکی، زرخیز مٹی',
      description: `سورج مکھی ایک اہم خوراکی تیل کی فصل ہے۔ یہ ملکی خوراکی تیل کی داخلی پیداوار میں اضافہ کرنے میں اہم کردار ادا کر سکتی ہے۔ جیسا کہ ہم جانتے ہیں، پاکستان ہر سال اپنی خوراکی تیل کی ضروریات کو پورا کرنے کے لئے دوسرے ممالک سے تقریباً 350 ارب روپے مالیت کا خوراکی تیل درآمد کرتا ہے۔ جو کہ مہنگا ہونے کے ناطے قیمتی اربوں روپے کا نقصان بھی کرتا ہے۔ اب وقت آ گیا ہے کہ ہر کسان کو اپنے علاقے کی مٹی اور آب و ہوا کو مدنظر رکھتے ہوئے دوسری فصلوں کے ساتھ کچھ حصہ میں سورج مکھی کی کاشت ضرور کرنی چاہئے کیونکہ اب سورج مکھی بھی ایک منافع بخش فصل بن چکی ہے۔
      کاشت کا وقت
      پنجاب کو سورج مکھی کی کاشت کے لئے تین حصوں میں تقسیم کیا گیا ہے۔
      پہلے حصے میں ڈیرہ غازی خان اور راجن پور شامل ہیں۔ ان ضلعوں میں سورج مکھی کی کاشت کے لئے بہترین وقت 20 دسمبر سے 31 جنوری 2023 تک ہے۔
      دوسرے مرحلے میں بہاولپور، بہاولنگر، رحیم یار خان، خانیوال، ملتان، مظفر گڑھ، ڈیرہ غازی خان، لیہ، لودھراں، بھکر، اور وہاڑی شامل ہیں۔ ان ضلعوں میں سورج مکھی کی کاشت کے لئے بہترین وقت 1 جنوری سے 31 جنوری 2023 تک مقرر کیا گیا ہے۔
      جبکہ تیسرے مرحلے میں میانوالی، سرگودھا، خوشاب، جھنگ، گوجرانوالہ، لاہور، منڈی بہاوالدین، قصور، شیخوپورہ، ساہیوال، اوکاڑہ، فیصل آباد، سیالکوٹ، اور ننکانہ صاحب شامل ہیں۔ ان ضلعوں میں سورج مکھی کی کاشت کے لئے بہترین وقت 15 جنوری سے 15 فروری 2023 تک ہے `,
      image: require('../Images/sunFlower.jpeg'),
      otherInfo: 'سورج مکھی کے بیج کو خوراک کے طور پر بھی استعمال کیا جاتا ہے۔',
    },
    {
      id: '6',
      name: 'تیل دار بیج',
      season: 'خریف و ربیع',
      waterRequirements: 'مختلف',
      majorProducingAreas: 'پنجاب',
      idealTemperature: 'مختلف',
      soilType: 'مختلف',
      description: `پاکستان کی بڑھتی ہوئی آبادی کے باعث، خوراکی تیل کی کمی میں اضافہ ہو رہا ہے اور اس بڑھتی ہوئی آبادی کی خوراکی تیل کی ضروریات کو پورا کرنے کے لیے، مقامی پیداوار جیسے کہ ریپسیڈ، سرسوں، توریا، اور کینولا کے تیل کے بیج، موجودہ تیل کی طلب کو پورا نہیں کر پا رہی ہیں۔ جیسا کہ آپ جانتے ہیں، خوراکی تیل ہماری خوراک کا اہم جزو ہے لیکن پاکستان اپنی خوراکی تیل کی کل ضرورت کا صرف 25% خود پیدا کرتا ہے جبکہ باقی 75% بہت بڑی لاگت پر بیرون ممالک سے درآمد کی جاتی ہے جو ملک کے زرمبادلہ کے ذخائر کو ختم کر دیتی ہے۔
      حالیہ عرصے میں، ان تیل کے بیجوں کے تحت کاشت کی جانے والی زمین میں اضافہ ہوا ہے، لیکن فی ایکڑ پیداوار میں بھی اضافہ کرنے کی ضرورت ہے۔ جس سے مستقبل میں، نہ صرف ملک کی خوراکی تیل کی ضروریات پوری ہوں گی، بلکہ خوراکی تیل کی برآمد سے بہت زیادہ زرمبادلہ بھی کمایا جا سکے گا۔
      سرسوں، رائی، اور کینولا کی نئے طور پر تیار کردہ اور سفارش کردہ اقسام:
      پیلا رایا، خانپور رایا، انمول رایا، سپر رایا، روہی سرسوں، پنجاب کینولا، فیصل کینولا، سپر کینولا، اور آری کینولا۔ سرسوں، رایا، اور کینولا کی یہ سفارش کردہ اقسام ہیں جو وسطی، شمالی، اور جنوبی پنجاب کے آبپاشی والے علاقوں میں کامیابی سے کاشت کی جا رہی ہیں۔ نئے تیار شدہ اقسام کی بروقت کاشت کے علاوہ، جدید زرعی ٹیکنالوجی اپنا کر ان تیل کے بیجوں کی فی ایکڑ پیداوار میں بہت زیادہ اضافہ کیا جا سکتا ہے۔
      زمین کی تیاری اور کاشت کا وقت:
      نرم، زرخیز، ہوادار، اور ہموار مٹی سرسوں، توریا، رایا، کینولا کی کاشت کے لیے بہت اہم ہے۔ اگر کھیت میں خر پتوار نہیں ہیں تو صرف 2 سے 3 بار ہل چلا کر اور ایک بار گوبر پلٹ کر زمین کو اچھی طرح تیار کریں۔ اگر کھیت میں خرپتوار ہیں تو ہل چلانے سے پہلے روٹاویٹر چلانا یقینی بنائیں تاکہ خرپتوار کو مارا جا سکے۔ مائن زمین سرسوں، توریا، رایا، کینولا کی کاشت کے لیے سب سے موزوں ہے کیونکہ اس کی پانی جذب کرنے کی صلاحیت کلرتھی زمین اور سیم و تھور زمین کی نسبت زیادہ ہوتی ہے اور یہ فصلوں کی کاشت کے لیے ناموزوں ہے۔`,
      image: require('../Images/mustarad.jpg'),
      otherInfo: 'تیل دار بیج میں سورج مکھی، کنولا وغیرہ شامل ہیں۔',
    },
    {
      id: '7',
      name: 'گنا',
      season: 'سال بھر',
      waterRequirements: 'زیادہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '24 سے 30 ڈگری سینٹی گریڈ',
      soilType: 'گہری، زرخیز مٹی',
      description: `نجاب حکومت نے نئی گنے کی قیمت 400 روپے فی من اور سندھ حکومت نے نئی گنے کی قیمت 425 روپے فی من مقرر کی ہے۔ پنجاب میں گنے کی کرشنگ 25 نومبر 2023 سے شروع ہو چکی ہے۔ چونکہ پنجاب میں گنے کی شرح سندھ میں گنے کی شرح سے 25 روپے کم ہے، اس لئے یہ خدشہ ہے کہ پنجاب کے کسان پنجاب میں گنے کی کم قیمت کی وجہ سے اپنا گنا سندھ میں فروخت کریں گے۔
      پنجاب کے خوراک محکمہ نے گنے کی کرشنگ کے لئے ایک اطلاع جاری کی ہے، جس میں کہا گیا ہے کہ اگر کوئی شوگر مل 25 نومبر سے گنے کی کرشنگ شروع نہیں کرتی، تو اس شوگر مل پر روزانہ 10 لاکھ روپے کا جرمانہ عائد کیا جائے گا۔ اطلاع میں یہ بھی کہا گیا ہے کہ شوگر مل مالکان کو کسانوں کو ان کے گنے کی قیمت 15 دنوں کے اندر ادا کرنی ہوگی، فی ماہ سیس کی قیمت 5 روپے رکھی گئی ہے۔
      مارکیٹ ذرائع کے مطابق، حکومت کی جانب سے گنے کی قیمت میں 75 روپے فی من کے اضافے کی وجہ سے چینی کی قیمت میں فی کلو 15 روپے کا اضافہ ہونے کا امکان ہے۔ اس کے علاوہ، گنے کی کاشت میں 10% کمی کی وجہ سے موجودہ موسم 2024 کے دوران گنے کی پیداوار بھی کم ہونے کا امکان ہے۔ اگر فی ایکڑ گنے کی پیداوار کم ہوتی ہے، تو ملک کی ضرورت کے مطابق چینی کی پیداوار ممکن نہیں ہوگی۔
      یاد رہے کہ پاکستان کے آئین میں اٹھارہویں ترمیم کے بعد، زراعت کے شعبے کو صوبائی حکومت کو دے دیا گیا تھا۔ اس ترمیم کے بعد، گندم کی قیمت اور گنے کی قیمت سمیت دیگر زرعی اشیاء کی حمایت یا کم سے کم قیمت کا اعلان کرنا صوبائی حکومت کی ذمہ داری ہے۔`,
      image: require('../Images/sugarcane.jpeg'),
      otherInfo: 'پاکستان میں گنے کی کاشت سے چینی کی صنعت کو فروغ ملتا ہے۔',
    },
    {
      id: '8',
      name: 'دھان',
      season: 'خریف',
      waterRequirements: 'زیادہ',
      majorProducingAreas: 'پنجاب، سندھ',
      idealTemperature: '22 سے 30 ڈگری سینٹی گریڈ',
      soilType: 'پانی سے بھرپور مٹی',
      description: `دھان، جسے عام طور پر منجی کے نام سے بھی جانا جاتا ہے، ایک اہم نقد فصل ہے۔ پاکستان میں، گندم کی کاشت، مکئی کی کاشت، اور کپاس کی کاشت کے ساتھ دھان کی کاشت بڑے رقبے پر کی جاتی ہے۔ پنجاب میں دھان کی بسمتی اقسام جیسے کہ بسمتی 370، شاہین بسمتی، بسمتی پاک، سپر بسمتی، بسمتی 2000، بسمتی 515، کسان بسمتی، پنجاب بسمتی، چناب بسمتی، سپر بسمتی 2019، سپر گولڈ اور غیر بسمتی اقسام جیسے کہ پی کے 1121 ارومیٹک، پی کے 386، پی کے 2021 وغیرہ کی کامیاب کاشت کی جاتی ہے اور ان اقسام کو مجموعی طور پر باریک اقسام کہا جاتا ہے۔
      باریک اقسام کے علاوہ، موٹی اقسام جیسے کہ آری 6، کے ایس کے 434، کے ایس 282، کے ایس کے 133 اور ہائبرڈ اقسام پی ایچ بی 7، وائی 26، شہنشاہ 2، پرائیڈ 1، ارائز سوئفٹ وغیرہ بھی کافی رقبے پر کاشت کی جاتی ہیں۔ جب مونگ کی فصل تیار ہوتی ہے، تو کسان مونگ کے ریٹ کو جاننا شروع کر دیتے ہیں تاکہ فصل کو اچھی قیمت پر فروخت کیا جا سکے۔ آج 2024 میں ہم دھان کے ریٹ کو جانیں گے۔     
      (نوٹ: "پی کے 1121 ارومیٹک" کے ساتھ ایک شناختی غلطی کا ذکر کیا گیا ہے، جو کہ اصل میں ایک مخصوص قسم جیسے "پی کے 1121 ارومیٹک" ہونے کا امکان ہے لیکن OCR نے اسے غلط تعبیر کیا ہے۔)`,
      image: require('../Images/paddy.jpeg'),
      otherInfo: 'چاول کی اقسام میں بسمتی پاکستان کی مشہور قسم ہے۔',
    },
    {
      id: '9',
      name: 'تل',
      season: 'موسم گرما',
      waterRequirements: 'کم',
      majorProducingAreas: 'پنجاب',
      idealTemperature: '25 سے 35 ڈگری سینٹی گریڈ',
      soilType: 'بلوغت آمیز مٹی',
      description: `تل اور تلی ایک بہت اہم تیل کا بیج اور نقد فصل ہے۔ تل اور دالوں کی کاشت میں ملوث کسان اس سال زرعی اجناس کی شرح میں سب سے زیادہ اضافہ ہونے کے نتیجے میں بڑے مالی فوائد حاصل کر سکتے ہیں، جبکہ مکئی، کپاس، اور دھان کی قیمتوں میں کمی آئی ہے۔ بارلے کی قیمت کے ساتھ باجرے کی قیمت مستحکم رہی ہے۔
        تل اور دالوں کی کاشت کے لیے درمیانے سے بھاری چکنی مٹی جو پانی جذب کرنے اور نمی برقرار رکھنے کی اچھی صلاحیت رکھتی ہو، اچھی پیداوار دے سکتی ہے۔ تل اور سوفلاور کی بیلوں کی کاشت ان علاقوں میں سفارش کی جاتی ہے جہاں بارش کی مقدار زیادہ ہو کیونکہ خشک سالی کی صورت میں، کھیت میں پانی کی مقدار تل کی فصل کی آبپاشی کی وجہ سے یا بھاری بارش کی وجہ سے زیادہ ہوگی۔ زیادہ پانی دینے سے تل اور تلی کے پودوں میں مرجھاؤ کا خطرہ بڑھ جاتا ہے۔
        تل اور تلی بونے سے پہلے، 2 سے 3 بار ہل چلا کر اور پھر مٹی کو نرم اور زرخیز بنانے کے لیے ہل چلانا چاہیے تاکہ مٹی اچھی طرح تیار ہو کیونکہ جب تک مٹی اچھی طرح تیار نہیں ہوگی بیج کی انکر موزوں نہیں ہوگی، جس سے تل اور تلی کی مطلوبہ پیداوار حاصل کرنے میں مشکلات پیش آ سکتی ہیں۔ کالے اور سفید دونوں تل اہم ہیں۔
        اب 2024 میں آج پاکستان میں تل اور تلی کی قیمت کی بات کرتے ہیں۔ پاکستان کے مختلف شہروں خصوصاً فیصل آباد، گوجرانوالہ، اوکاڑہ، سرگودھا، راولپنڈی، ملتان، رحیم یار خان، بھکر، بھلوال، قصور، ساہیوال، وہاڑی، بورے والا، گجرات، خانیوال، لاہور، مظفر گڑھ، بہاولپور، کبیر والا، پتوکی، اریفوالا، جردانوالا، لودھراں، چشتیاں، بہالنگر، گجر خان، میلسی، کہروڑ پکا، چیچہ وطنی، دنیاپور، ڈیرہ غازی خان، چونیاں، پھولنگر، لالہ موسیٰ، منڈی بہاوالدین، جلالپور جٹاں، ڈسکہ، کمالیہ، پیر محل، جلالپور پیروالا، جہانیاں، احمدپور شرقیہ، ہاشلپور، جامپور، نارووال، چکوال، جہلم، میانوالی، جھنگ، کوٹ ادو، رینالہ خورد، سیالکوٹ، ننکانہ صاحب، چک جھمرہ، سی، تاندلیانوالہ، مموں کنجن، چنیوٹ، شورکوٹ، مریدکے، فورٹ عباس، تلہ گنگ، پسرور، حافظ آباد، پنڈی بھٹیاں، کوٹ مومن اور سانگلا ہل میں تل اور تلی کی قیمت 17,000 سے 18,500 روپے فی من ہے۔`,
      image: require('../Images/sesame.jpeg'),
      otherInfo: 'تل سے تیل کے علاوہ مختلف مصنوعات بنائی جاتی ہیں۔',
    },
    {
      id: '10',
      name: 'باجرا',
      season: 'خریف',
      waterRequirements: 'درمیانہ سے کم',
      majorProducingAreas: 'مختلف شہروں میں',
      idealTemperature: '27 سے 32 ڈگری سینٹی گریڈ',
      soilType: 'ہلکی، زرخیز مٹی',
      description: `بجرہ پاکستان میں گھریلو پالتو جانوروں کے کھانے کے لیے استعمال ہونے والی ایک اہم زراعتی جنس ہے۔ یہ دیہاتی علاقوں میں مویشیوں اور پولٹری کی خوراک کا اہم حصہ ہے اور پالتو پرندوں کے لیے بہت مقبول خوراک ہے کیونکہ پرندوں کو یہ بہت پسند ہے۔ بجرہ سردیوں کے موسم میں جب ہری چارہ کم ہو جاتی ہے تو خشک چارہ کے طور پر بھی استعمال کیا جاتا ہے۔ بجرے میں پروٹین، وٹامنز اور منرلز کی اچھی مقدار پائی جاتی ہے
      مارچ 2024 میں پاکستان کے زیادہ تر شہروں بشمول کراچی اور لاہور خصوصاً فیصل آباد، گوجرانوالہ، اوکاڑہ، سرگودھا، راولپنڈی، ملتان، رحیم یار خان، بھکر، بھل ​​
      وال، کسور، ساہیوال، وہاڑی، بورے والا، اریف والا، گجرات، خانیوال، مظفر گڑھ، ڈیرہ غازی خان، بہاولپور، کبیر والا، پتوکی، جڑانوالہ، لودھراں، بہاولنگر، چشتیاں، گجرخان، میلسی، کہروڑپکا، چیچہ وطنی، دنیاپور، چونیاں، پھولنگر، لالہ موسیٰ، منڈی بہاؤالدین، جلالپور جٹاں، ڈسکہ، کمالیہ، پیرمحل، جلالپور پیروالا، جہانیاں، احمدپور شرقیہ، حاصلپور، جامپور، سیالکوٹ، نارووال، چکوال، جہلم، میانوالی، جھنگ، کوٹ ادو، ننکانہ صاحب، چک جھمرہ، سراندی، تاندلیانوالہ، مموں کنجن، رینالہ خورد، چنیوٹ، شورکوٹ، مریدکے، فورٹ عباس، تلہ گنگ، پسرور، سانگلہ ہل، حافظ آباد، کوٹ مومن، اور پنڈی بھٹیاں میں بجرہ کی قیمت 2700 سے 2900 روپے فی من ہے۔ `,
      image: require('../Images/millet.jpeg'),
      otherInfo:
        'باجرا غذائیت سے بھرپور ایک اہم فصل ہے، جو خشک سالی میں بھی اچھی طرح اُگ سکتی ہے۔',
    },
  ]);

  const renderItem = ({ item }) => (
    <TouchableOpacity
      style={styles.cropItem}
      onPress={() => navigation.navigate('CropDetailScreen', { crop: item })}
    >
      <Image source={item.image} style={styles.cropImage} />
      <View style={styles.cropDetails}>
        <Text style={styles.cropName}>{item.name}</Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>موسم:</Text> {item.season}
        </Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>پانی کی ضروریات:</Text>{' '}
          {item.waterRequirements}
        </Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>اہم پیداواری علاقے:</Text>{' '}
          {item.majorProducingAreas}
        </Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>مثالی درجہ حرارت:</Text>{' '}
          {item.idealTemperature}
        </Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>مٹی کی قسم:</Text> {item.soilType}
        </Text>
        <Text style={styles.cropInfo}>
          <Text style={styles.boldText}>دیگر معلومات:</Text> {item.otherInfo}
        </Text>
      </View>
    </TouchableOpacity>
  );

  return (
    <View style={styles.container}>
      <View style={styles.header}>
        <Text style={styles.headerText}>فصلوں کی معلومات</Text>
      </View>
      <FlatList
        data={crops}
        keyExtractor={(item) => item.id}
        renderItem={renderItem}
      />
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: 'deepskyblue',
  },
  boldText: {
    fontWeight: 'bold',
  },
  header: {
    backgroundColor: '#4b830d',
    paddingVertical: 20,
    alignItems: 'center',
    marginBottom: 20,
  },
  headerText: {
    fontSize: 24,
    color: '#fff',
    fontWeight: 'bold',
  },
  cropItem: {
    flexDirection: 'row',
    alignItems: 'center',
    padding: 10,
    marginVertical: 5,
    marginHorizontal: 10,
    backgroundColor: '#baf57a',
    borderRadius: 10,
    elevation: 1,
    shadowColor: '#000',
    shadowOffset: { width: 0, height: 1 },
    shadowOpacity: 0.22,
    shadowRadius: 2.22,
  },
  cropImage: {
    width: 140,
    height: 140,
    borderRadius: 10,
    marginRight: 15,
  },
  cropDetails: {
    flex: 1,
  },
  cropInfo: {
    fontSize: 16,
    color: '#333',
    marginBottom: 5,
  },
  cropName: {
    fontSize: 20,
    fontWeight: 'bold',
    marginBottom: 10,
    color: '#333',
  },
});

export default CropInfoScreen;